# ✔ Напишите функцию, которая принимает строку текста. Вывести функцией каждое слово с новой строки.
# ✔ Строки нумеруются начиная с единицы.
# ✔ Слова выводятся отсортированными согласно кодировки Unicode.
# ✔ Текст выравнивается по правому краю так, чтобы у самого длинного слова был один пробел между ним и номером строки.

def num_of_word(text: str) -> None:
    result = sorted(text.split())
    [print(f"{i} {word:>{len(max(result, key=len))}}") for i, word in enumerate(result, 1)]


num_of_word('Hello world and galaxy')
