# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 1
b = 'str'
c = 0.5
d = (1, 1)
e = {1: 3}

print(type(a))
print(type(b))
print(type(c))
print(type(d))
print(type(e))
