# Создайте модуль с функцией внутри.
# Функция получает на вход загадку, список с возможными вариантами отгадок и количество попыток на угадывание.
# Программа возвращает номер попытки, с которой была отгадана загадка или ноль, если попытки исчерпаны.
import Task_4_1S

print(Task_4_1S.mistery("Не лает не кусает, в дом не пускает.", ["замок", "засов"], 3))
